package com.hengde.nivi;

public class SerialBeanFilter {
    private static final float[] b={1.97376446371309e-09f, 0f, -1.97376446371309e-08f, 0f, 8.88194008670892e-08f, 0f, -2.36851735645571e-07f, 0f, 4.14490537379750e-07f, 0f, -4.97388644855700e-07f, 0f, 4.14490537379750e-07f, 0f, -2.36851735645571e-07f, 0f, 8.88194008670892e-08f, 0f, -1.97376446371309e-08f, 0f, 1.97376446371309e-09f};
    private static final float[] a={1, -18.0999782145824f, 155.693282576137f, -846.282780836964f, 3260.09724504258f, -9461.14204947704f, 21462.8937910910f, -38973.4655104436f, 57533.8165471094f, -69729.4730716965f, 69762.2493257512f, -57716.3793282957f, 39417.9588823464f, -22102.3966961015f, 10075.6903500492f, -3676.79000835292f, 1048.87310092608f, -225.428821588684f, 34.3404480257075f, -3.30600318210941f, 0.151275271778835f};

    public static float[] xBuf={0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
    public static float[] yBuf={0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
    public static float serialBeanFilter(float x) {
        int i;
        //运算之前Buf向前移动一个位置，以保存之前Buf的数据；
        for(i=20; i>0; i--)
        {
            yBuf[i] = yBuf[i-1];
            xBuf[i] = xBuf[i-1];
        }
        xBuf[0] = x;
        yBuf[0] = 0;
        for(i=1;i<21;i++)
        {
            yBuf[0] = yBuf[0] + b[i]*xBuf[i];
            yBuf[0] = yBuf[0] - a[i]*yBuf[i];
        }
        yBuf[0] = yBuf[0] + b[0]*xBuf[0];
        return yBuf[0];
    }
}
